https://www.kaggle.com/  
https://pandas.pydata.org/docs/user_guide/io.html

In [4]:
import pandas as pd

In [32]:
df = pd.read_csv('data/titanic_train.csv', sep=',')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,body,home.dest
0,2,1,"Mellinger, Miss. Madeleine Violet",female,13.0,0,1,250644,19.5000,NaN,S,NaN,"England / Bennington, VT"
1,2,1,"Wells, Miss. Joan",female,4.0,1,1,29103,23.0000,NaN,S,NaN,"Cornwall / Akron, OH"
2,2,1,"Duran y More, Miss. Florentina",female,30.0,1,0,SC/PARIS 2148,13.8583,NaN,C,NaN,"Barcelona, Spain / Havana, Cuba"
3,3,0,"Scanlan, Mr. James",male,NaN,0,0,36209,7.7250,NaN,Q,NaN,NaN
4,3,1,"Bradley, Miss. Bridget Delia",female,22.0,0,0,334914,7.7250,NaN,Q,NaN,"Kingwilliamstown, Co Cork, Ireland Glens Falls..."

In [52]:
f = open("data/ex1.csv", 'w') # """"<== 스트링이 여러줄있다
data = """
a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo"""
f.write(data)
f.close()

In [53]:
df1 = pd.read_csv('data/ex1.csv')
df1

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [57]:
f = open("data/ex1.csv", 'w') # """"<== 스트링이 여러줄있다
data = """
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo"""
f.write(data)
f.close()

In [58]:
df1 = pd.read_csv('data/ex1.csv')
df1

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [59]:
df2 = pd.read_csv('data/ex1.csv', header=None)
df2

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [60]:
df2 = pd.read_csv('data/ex1.csv', names=['a','b','c','d','message'])
df2

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [30]:
names=['a','b','c','d','message']
df2 = pd.read_csv('data/ex1.csv', names=names, index_col='message')
df2

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [38]:
f = open("data/csv_mindex.csv", 'w')
data = """
key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16
"""
f.write(data)
f.close()

In [39]:
df3=pd.read_csv('data/csv_mindex.csv')
df3

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

- 계층적 색인 지정

In [35]:
parsed = pd.read_csv('data/csv_mindex.csv', index_col=['key1','key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [41]:
f = open("data/ex3.txt", 'w')
data = """
            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871859 -0.348382  1.100491
"""
f.write(data)
f.close()

In [42]:
result = pd.read_table('data/ex3.txt', sep='\s+') # \s+ 옵션은 중간 공백으로 구분
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871859 -0.348382  1.100491

In [45]:
f = open("data/ex4.csv", 'w')
data = """#Hey!
a,b,c,d,message
# Hello Python
# CSV file
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo
"""
f.write(data)
f.close()

In [47]:
 df4 = pd.read_csv('data/ex4.csv',skiprows=[0, 2, 3])
 df4

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [73]:
# 불필요한 라인 찾기
f = open("data/ex4.csv", 'r', encoding='utf-8')
num=0
skiplist=[]
while True :
    line = f.readline()
    if not line :
        break

    # if  '#' in line :
    if line[0] == '#' :
        skiplist.append(num)
    num+=1

f.close()
skiplist

[0, 2, 3]

In [74]:
 df4 = pd.read_csv('data/ex4.csv',skiprows=skiplist)
 df4

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [75]:
f = open("data/ex5.csv", 'w')
data = """something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo
"""
f.write(data)
f.close()

In [76]:
result = pd.read_csv('data/ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [77]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [80]:
result = pd.read_csv('data/ex5.csv', na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [83]:
sentinels = {'message':['foo','NA'], 'something':['two']}
result = pd.read_csv('data/ex5.csv', na_values=sentinels)
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

## 엑셀파일 읽기

In [90]:
frame = pd.read_excel('data/ex01.xlsx', 'Sheet1')
frame

   a   b   c   d message
0  0   1   2   3   hello
1  4   5   6   7   world
2  9  10  11  12     foo

## 엑셀파일 저장

In [94]:
writer = pd.ExcelWriter('data/ex02.xlsx')
frame.to_excel(writer,'Sheet1')
writer.save()

In [95]:
frame = pd.read_excel('data/ex02.xlsx', 'Sheet1')
frame

   Unnamed: 0  a   b   c   d message
0           0  0   1   2   3   hello
1           1  4   5   6   7   world
2           2  9  10  11  12     foo